# LayerMapping Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..LayerMapping Property
BaseExportOptions Class See Also
---
Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string LayerMapping { get; set; }
```

Visual Basic
---
```text
Public Property LayerMapping As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ LayerMapping {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace